renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_sdc_sdmem_rx/r_sdc_sd_rx_if.h
/**********************************************************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No 
* other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all 
* applicable laws, including copyright laws. 
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY, 
* FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM 
* EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES 
* SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS
* SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of 
* this software. By using this software, you agree to the additional terms and conditions found by accessing the 
* following link:
* http://www.renesas.com/disclaimer 
*
* Copyright (C) 2014(2015-2018) Renesas Electronics Corporation. All rights reserved.    
**********************************************************************************************************************/

/**********************************************************************************************************************
* File Name    : r_sdc_sd_rx_if.h
* Device       : RX
* Tool-Chain   : RX Family C Compiler
* H/W Platform : RSK board for RX
* Description  : Interface file for SDC SD API for RX
***********************************************************************************************************************
* History : DD.MM.YYYY Version Description
*         : 05.09.2014 1.00    First Release
*         : 17.07.2015 1.10    Standardized by the combo.
*         : 06.01.2016 1.20    Changed r_sdhi_set_speed().
*         : 30.09.2016 1.21    Added error code of SDC_SD_ERR_UNSUPPORTED_TYPE.
*         :                    Changed driver version.
*         : 31.07.2017 2.00    SDHI FIT module separated into hardware low level layer and middleware layer.
*         :                    Changed prefix from SDHI to SDC_SD.
*         : 31.12.2017 2.01    The sample program corresponded to the pin setting of Smart Configurator.
*         :                    There is no change in the FIT module.
*         : 29.06.2018 2.02    Corresponded to SD Specifications Part1 Physical Layer Simplified Specification.
*         : 30.11.2018 2.03    Corresponded to FIT guide function of Smart Configurator.
**********************************************************************************************************************/

#ifndef SDC_SD_RX_H
#define SDC_SD_RX_H

/**********************************************************************************************************************
Includes   <System Includes> , "Project Includes"
**********************************************************************************************************************/
/* Used to get which MCU is currently being used. */
#include "platform.h"
#include "r_sdhi_rx_if.h"
#include "r_sdhi_rx_config.h"

/**********************************************************************************************************************
Macro definitions
**********************************************************************************************************************/
/* #### SD Memory and common definitions #### */
/* Version Number of API. */
#define RX_SDC_SD_VERSION_MAJOR     (2)
#define RX_SDC_SD_VERSION_MINOR     (03)

#define SDC_SD_CARD_NO0             (0)
#define SDC_SD_CARD_NO1             (1)

#define SDC_SDMEM_MAX_TRANS         (65535)
#define SDC_SDIO_MAX_TRANS          (256)
#define SDC_SD_MAX_AGAIN_COUNT      (3)

/* ---- Driver mode ---- */
#define SDC_SD_MODE_POLL            (0x0000ul)  /* Status check mode: Software polling */
#define SDC_SD_MODE_HWINT           (0x0001ul)  /* Status check mode: Hardware interrupt */
#define SDC_SD_MODE_SW              (0x0000ul)  /* Data transfer mode: Software(PIO) */
#define SDC_SD_MODE_DMA             (0x0002ul)  /* Data transfer mode: DMA */
#define SDC_SD_MODE_DTC             (0x0004ul)  /* Data transfer mode: DTC */
#define SDC_SD_MODE_SW_SINGLE       (0x0008ul)  /* Data transfer mode: Software(PIO) (SINGLE READ:Not User SET) */

/* ---- Support mode ---- */
#define SDC_SD_MODE_MEM             (0x0020ul)  /* Memory card (SD Memory, MMC) */
#define SDC_SD_MODE_IO              (0x0010ul)  /* Memory and SDIO */
#define SDC_SD_MODE_COMBO           (0x0030ul)  /* SD Memory, SDIO and SD Combo */
#define SDC_SD_MODE_1BIT            (0x0100ul)  /* SD Mode: 1bit only */
#define SDC_SD_MODE_4BIT            (0x0200ul)  /* SD Mode: 1bit and 4bit */

/* ---- Media voltage ---- */
#define SDC_SD_VOLT_1_7             (0x00000010ul)  /* Low voltage card minimum */
#define SDC_SD_VOLT_1_8             (0x00000020ul)
#define SDC_SD_VOLT_1_9             (0x00000040ul)
#define SDC_SD_VOLT_2_0             (0x00000080ul)
#define SDC_SD_VOLT_2_1             (0x00000100ul)  /* Basic communication minimum */
#define SDC_SD_VOLT_2_2             (0x00000200ul)
#define SDC_SD_VOLT_2_3             (0x00000400ul)
#define SDC_SD_VOLT_2_4             (0x00000800ul)
#define SDC_SD_VOLT_2_5             (0x00001000ul)
#define SDC_SD_VOLT_2_6             (0x00002000ul)
#define SDC_SD_VOLT_2_7             (0x00004000ul)
#define SDC_SD_VOLT_2_8             (0x00008000ul)  /* Memory access minimum */
#define SDC_SD_VOLT_2_9             (0x00010000ul)
#define SDC_SD_VOLT_3_0             (0x00020000ul)
#define SDC_SD_VOLT_3_1             (0x00040000ul)
#define SDC_SD_VOLT_3_2             (0x00080000ul)
#define SDC_SD_VOLT_3_3             (0x00100000ul)
#define SDC_SD_VOLT_3_4             (0x00200000ul)
#define SDC_SD_VOLT_3_5             (0x00400000ul)
#define SDC_SD_VOLT_3_6             (0x00800000ul)

