renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_sdc_sdmem_rx/r_sdc_sd_rx_if.h
/* ---- Memory card write mode ---- */
#define SDC_SD_WRITE_WITH_PREERASE  (0x0000u)   /* Pre-erase write */
#define SDC_SD_WRITE_OVERWRITE      (0x0001u)   /* Overwrite */

 /* ---- Media type ---- */
#define SDC_SD_MEDIA_UNKNOWN        (0x0000u)   /* Unknown media */
#define SDC_SD_MEDIA_MMC            (0x0010u)   /* MMC card */
#define SDC_SD_MEDIA_SDMEM          (0x0020u)   /* SD Memory card */
#define SDC_SD_MEDIA_SDIO           (0x0001u)   /* SDIO card */
#define SDC_SD_MEDIA_MEM            (0x0030u)   /* Memory card */
#define SDC_SD_MEDIA_COMBO          (0x0021u)   /* SD COMBO card */

/* ---- Write protect information --- */
#define SDC_SD_WP_OFF               (0x0000u)   /* No write protect */
#define SDC_SD_WP_HW                (0x0001u)   /* H/W write protect */
#define SDC_SD_WP_TEMP              (0x0002u)   /* TEMP_WRITE_PROTECT */
#define SDC_SD_WP_PERM              (0x0004u)   /* PERM_WRITE_PROTECT */
#define SDC_SD_WP_ROM               (0x0010u)   /* SD ROM */

/* ---- SD clock define ---- */ /* Max. frequency */
#define SDC_SD_CLK_400kHz           (0x0000u)   /* 400kHz */
#define SDC_SD_CLK_1MHz             (0x0001u)   /* 1MHz */
#define SDC_SD_CLK_5MHz             (0x0002u)   /* 5MHz */
#define SDC_SD_CLK_10MHz            (0x0003u)   /* 10MHz */
#define SDC_SD_CLK_20MHz            (0x0004u)   /* 20MHz */
#define SDC_SD_CLK_25MHz            (0x0005u)   /* 25MHz */
#define SDC_SD_CLK_50MHz            (0x0006u)   /* 50MHz */

/* ---- Speed class ---- */
#define SDC_SD_SPEED_CLASS_0        (0x00u)     /* Not defined */
#define SDC_SD_SPEED_CLASS_2        (0x01u)     /* 2MB/sec */
#define SDC_SD_SPEED_CLASS_4        (0x02u)     /* 4MB/sec */
#define SDC_SD_SPEED_CLASS_6        (0x03u)     /* 6MB/sec */
#define SDC_SD_SPEED_CLASS_10       (0x04u)     /* 10MB/sec */

/* ---- SD Card detect port ---- */
#define SDC_SD_CD_SOCKET            (0x0000u)   /* CD pin */
#define SDC_SD_CD_DAT3              (0x0001u)   /* DAT3 pin */

/* ---- SD Card detect interrupt ---- */
#define SDC_SD_CD_INT_DISABLE       (0x0000u)   /* Card detect interrupt disable */
#define SDC_SD_CD_INT_ENABLE        (0x0001u)   /* Card detect interrupt enable */

/* ---- SD Card detect ---- */
#define SDC_SD_CD_REMOVE            (0x0000u)   /* Removal */
#define SDC_SD_CD_INSERT            (0x0001u)   /* Insert */

/* ---- Format mode ---- */
#define SDC_SD_FORMAT_QUICK         (0x0000u)   /* Quick format */
#define SDC_SD_FORMAT_FULL          (0x0001u)   /* Full format */

/* ---- Lock/Unlock mode ---- */
#define SDC_SD_UNLOCK_CARD          (0x00)
#define SDC_SD_SET_PWD              (0x01)
#define SDC_SD_CLR_PWD              (0x02)
#define SDC_SD_LOCK_CARD            (0x04)
#define SDC_SD_FORCE_ERASE          (0x08)

/* ==== Command type ==== */
/* ---- SD commands ---- */
#define SDC_SD_CMD0                 (0u)    /* GO_IDLE_STATE */
#define SDC_SD_CMD2                 (2u)    /* ALL_SEND_CID */
#define SDC_SD_CMD3                 (3u)    /* SEND_RELATIVE_ADDR */
#define SDC_SD_CMD4                 (4u)    /* SET_DSR */
#define SDC_SD_CMD7                 (7u)    /* SELECT/DESELECT_CARD */
#define SDC_SD_CMD9                 (9u)    /* SEND_CSD */
#define SDC_SD_CMD10                (10u)   /* SEND_CID */
#define SDC_SD_CMD12                (12u)   /* STOP_TRANSMISSION */
#define SDC_SD_CMD13                (13u)   /* SEND_STATUS */
#define SDC_SD_CMD15                (15u)   /* GO_INACTIVE_STATE */
#define SDC_SD_CMD16                (16u)   /* SET_BLOCK_LEN */
#define SDC_SD_CMD17                (17u)   /* READ_SINGLE_BLOCK */
#define SDC_SD_CMD18                (18u)   /* READ_MULTIPLE_BLOCK */
#define SDC_SD_CMD24                (24u)   /* WRITE_SINGLE_BLOCK */
#define SDC_SD_CMD25                (25u)   /* WRITE_MULTIPLE_BLOCK */
#define SDC_SD_CMD27                (27u)   /* PROGRAM_CSD */
#define SDC_SD_CMD28                (28u)   /* SET_WRITE_PROT */
#define SDC_SD_CMD29                (29u)   /* CLR_WRITE_PROT */
#define SDC_SD_CMD30                (30u)   /* SEND_WRITE_PROT */
#define SDC_SD_CMD32                (32u)   /* ERASE_WR_BLK_START */
#define SDC_SD_CMD33                (33u)   /* ERASE_WR_BLK_END */
#define SDC_SD_CMD38                (38u)   /* ERASE */
#define SDC_SD_CMD42                (42u)   /* LOCK_UNLOCK */
#define SDC_SD_CMD55                (55u)   /* APP_SDC_SD_CMD */

/* ---- IO commands ---- */  /* add for IO */
#define SDC_SD_CMD5                 (0x4705u)   /* IO_SEND_OP_COND */
#define SDC_SD_CMD52_W              (0x4434u)   /* IO_WRITE_DIRECT */
#define SDC_SD_CMD52_R              (0x5434u)   /* IO_READ_DIRECT */
#define SDC_SD_CMD53_W_BLOCK        (0x6c35u)   /* IO_WRITE_EXTENDED_BLOCK */
#define SDC_SD_CMD53_W_BYTE         (0x4c35u)   /* IO_WRITE_EXTENDED_BYTE */
#define SDC_SD_CMD53_R_BLOCK        (0x7c35u)   /* IO_READ_EXTENDED_BLOCK */
#define SDC_SD_CMD53_R_BYTE         (0x5c35u)   /* IO_READ_EXTENDED_BYTE */

/* ---- Switch function command ---- */
#define SDC_SD_CMD6                 (0x1C06u)   /* SWITCH_FUNC */

/* ---- Dual voltage inquiry command ---- */
#define SDC_SD_CMD8                 (0x0408u)   /* SEND_IF_COND */

/* ---- Application specific commands ---- */
#define SDC_SD_ACMD                 (0x40u)
#define SDC_SD_ACMD6                (SDC_SD_ACMD|6u)  /* SET_BUS_WIDTH */
#define SDC_SD_ACMD13               (SDC_SD_ACMD|13u) /* SDC_SD_STATUS */
#define SDC_SD_ACMD22               (SDC_SD_ACMD|22u) /* SEND_NUM_WR_BLOCKS */
#define SDC_SD_ACMD23               (SDC_SD_ACMD|23u) /* SET_WR_BLK_ERASE_COUNT */
#define SDC_SD_ACMD41               (SDC_SD_ACMD|41u) /* SDC_SD_SEND_OP_COND */
#define SDC_SD_ACMD42               (SDC_SD_ACMD|42u) /* SET_CLR_CARD_DETECT */
#define SDC_SD_ACMD51               (SDC_SD_ACMD|51u) /* SEND_SCR */

/* ==== Constants ==== */
/* --- Command arguments --- */
#define SDC_SD_ARG_ACMD6_1bit       (0)
#define SDC_SD_ARG_ACMD6_4bit       (2)

/* ---- Response type  ---- */
#define SDC_SD_RESP_NON             (0)     /* No response */
#define SDC_SD_RESP_R1              (1)     /* Normal response */
#define SDC_SD_RESP_R1b             (2)     /* Normal response with an optional busy signal */
#define SDC_SD_RESP_R1_SCR          (3)     /* Normal response with an optional busy signal */
#define SDC_SD_RESP_R2_CID          (4)     /* CID register */
#define SDC_SD_RESP_R2_CSD          (5)     /* CSD register */
#define SDC_SD_RESP_R3              (6)     /* OCR register */
#define SDC_SD_RESP_R6              (7)     /* Published RCA response */
#define SDC_SD_RESP_R4              (8)     /* IO OCR register */
#define SDC_SD_RESP_R5              (9)     /* IO RW response */
#define SDC_SD_RESP_R7              (10)    /* Card Interface Condition response */

/* ---- COR register bit ---- */
#define SDC_SD_OCR_HCS              (0x40000000ul)  /* High Capacity Support */
#define SDC_SD_OCR_BUSY             (0x80000000ul)  /* Card power up status bit (busy) */

#define SDC_SD_ADDR_BOUNDARY        (0x00000003ul)


