renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_sdc_sdmem_rx/r_sdc_sd_rx_if.h
/* #### SDIO definitions #### */
/* ---- CCCR Format Version number ---- */
#define SDC_SDIO_CCCRFBR_VER_10     (0x00)  /* CCCR/FBR defined in SDIO Ver.1.00 */
#define SDC_SDIO_CCCRFBR_VER_11     (0x01)  /* CCCR/FBR defined in SDIO Ver.1.10 */
#define SDC_SDIO_CCCRFBR_VER_20     (0x02)  /* CCCR/FBR defined in SDIO Ver.2.00 */
#define SDC_SDIO_CCCRFBR_VER_30     (0x03)  /* CCCR/FBR defined in SDIO Ver.3.00 */
#define SDC_SDIO_CCCRFBR_VER_40     (0x04)  /* CCCR/FBR defined in SDIO Ver.4.00 */

/* ---- IO initialize flags define ---- */
#define SDC_SDIO_INT_ENAB           (0x10u) /* Interrupt enable */
#define SDC_SDIO_POWER_INIT         (0x04u) /* Power on initialized */
#define SDC_SDIO_MEM_INIT           (0x02u) /* Memory initialized */
#define SDC_SDIO_FUNC_INIT          (0x01u) /* IO function initialized */

/* ---- IO function's information ---- */
#define SDC_SDIO_FUNC_READY         (0x80u) /* IO Ready */
#define SDC_SDIO_FUNC_NUM           (0x70u) /* Number of IO functions */
#define SDC_SDIO_FUNC_EXISTS        (0x04u) /* Memory present */

/* ---- Function No definitions ---- */
#define SDC_SDIO_FNO_0              (0x00u) /* Function No. 0 */
#define SDC_SDIO_FNO_1              (0x01u) /* Function No. 1 */
#define SDC_SDIO_FNO_2              (0x02u) /* Function No. 2 */
#define SDC_SDIO_FNO_3              (0x03u) /* Function No. 3 */
#define SDC_SDIO_FNO_4              (0x04u) /* Function No. 4 */
#define SDC_SDIO_FNO_5              (0x05u) /* Function No. 5 */
#define SDC_SDIO_FNO_6              (0x06u) /* Function No. 6 */
#define SDC_SDIO_FNO_7              (0x07u) /* Function No. 7 */

/* ---- CMD52 R/W flag definitions ---- */
#define SDC_SDIO_RWFLAG_R           (0x00u) /* R/W flag : Read */
#define SDC_SDIO_RWFLAG_W           (0x01u) /* R/W flag : Write */

/* ---- CMD53 flag definitions ---- */
#define SDC_SDIO_BLOCKMODE_RWFLAG_R (0x08000000u)    /* CMD53 Block Mode and R/W flag is Read  */
#define SDC_SDIO_BLOCKMODE_RWFLAG_W (0x88000000u)    /* CMD53 Block Mode and R/W flag is Write */
#define SDC_SDIO_BYTEMODE_RWFLAG_R  (0x00000000u)    /* CMD53 Byte Mode  and R/W flag is Read  */
#define SDC_SDIO_BYTEMODE_RWFLAG_W  (0x80000000u)    /* CMD53 Byte Mode  and R/W flag is Write */

/* ---- I/O Address definitions ---- */
/* Card Common Control Registers (CCCR) */
#define SDC_SDIO_ADRS_CCCRSDIO      (0x00u)     /* CCCR/SDIO Revision */
#define SDC_SDIO_ADRS_IOENABLE      (0x02u)     /* I/O Enable */
#define SDC_SDIO_ADRS_IOREADY       (0x03u)     /* I/O Ready */
#define SDC_SDIO_ADRS_INTENABLE     (0x04u)     /* Int Enable */
#define SDC_SDIO_ADRS_IOABORT       (0x06u)     /* I/O Abort */
#define SDC_SDIO_ADRS_BUSINTRFACE   (0x07u)     /* Bus Interface */
#define SDC_SDIO_ADRS_CARDCAPAB     (0x08u)     /* Card Capability */
#define SDC_SDIO_ADRS_CISPTR0       (0x09u)     /* CIS Pointer (LSB) */
#define SDC_SDIO_ADRS_CISPTR1       (0x0Au)     /* CIS Pointer */
#define SDC_SDIO_ADRS_CISPTR2       (0x0Bu)     /* CIS Pointer (MSB) */
#define SDC_SDIO_ADRS_BLOCKSIZE0    (0x10u)     /* Block Size (LSB) */
#define SDC_SDIO_ADRS_BLOCKSIZE1    (0x11u)     /* Block Size (MSB) */
#define SDC_SDIO_ADRS_BUSSPEED      (0x13u)     /* Bus Speed Select */
#define SDC_SDIO_ADRS_MAX           (0x1FFFFu)  /* Bus Speed Select */

/* Function Basic Registers (FBR) */
#define SDC_SDIO_ADRS_CSAPTR0       (0x0Cu)     /* CSA Pointer (LSB)*/
#define SDC_SDIO_ADRS_CSAPTR1       (0x0Du)     /* CSA Pointer */
#define SDC_SDIO_ADRS_CSAPTR2       (0x0Eu)     /* CSA Pointer (LSB) */
#define SDC_SDIO_ADRS_CSADAW        (0x0Fu)     /* CSA Data Access Window */

/* ---- CMD5 Response definitions ---- */
#define SDC_SDIO_CMD5_R4_C          (0x80000000u)    /* Card Ready */
#define SDC_SDIO_CMD5_R4_NUMIOFNCS  (0x70000000u)    /* Number of I/O Functions */
#define SDC_SDIO_CMD5_R4_MEMPRESENT (0x08000000u)    /* Memory Present */
#define SDC_SDIO_CMD5_R4_UHS2STATUS (0x04000000u)    /* UHS-II Card Status */
#define SDC_SDIO_CMD5_R4_S18A       (0x01000000u)    /* S18A */
#define SDC_SDIO_CMD5_R4_IOOCR      (0x00FF8000u)    /* I/O OCR : 2.7V or more */
                                                     /* Set the range. */
                                                     /* move to config file */
#define SDC_SDIO_MEMPRESENT         (0x08u)     /* Memory Present */

/* ---- CCCR Flags definitions ---- */
#define SDC_SDIO_CCCRSDIO_CCCR      (0xFFu)     /* CCCR mask */
#define SDC_SDIO_IOENABLE_IOE1      (0x02u)     /* IOE1 (For 1 Function) */
#define SDC_SDIO_IOABORT_RES        (0x08u)     /* RES */
#define SDC_SDIO_INTENABLE_IENM     (0x01u)     /* IENM */
#define SDC_SDIO_CD_DIS_BUS_1BIT    (0x80u)     /* CD Disable, 1-bit bus */
#define SDC_SDIO_CD_DIS_BUS_4BIT    (0x82u)     /* CD Disable, 4-bit bus */
#define SDC_SDIO_CARDCAPAB_LSC      (0x40u)     /* Low Speed Card */
#define SDC_SDIO_CARDCAPAB_4BLS     (0x80u)     /* 4-bit Mode Support for Low Speed Card */
#define SDC_SDIO_CARDCAPAB_SMB      (0x02u)     /* Multiple Block Mode */
#define SDC_SDIO_BUSSPEED_SHS       (0x01u)     /* High Speed Supporting */
#define SDC_SDIO_BUSSPEED_BSS       (0x02u)     /* High Speed Setting */

#define SDC_SDIO_SDSIZE_512         (0x200u)    /* SDSIZE 512 bytes (default) */
#define SDC_SDIO_SDSIZE_INVALID     (0xFFFFu)   /* Invalid SDSIZE : 0xFFFF is not set to SDSIZE. */

/* ---- sdc_sdio_access_t op_code definitions ---- */
#define SDC_SDIO_BLOCK_MODE         (0x10u)     /* SDIO_BLOCK_MODE */
#define SDC_SDIO_BYTE_MODE          (0x00u)     /* SDIO_BYTE_MODE */
#define SDC_SDIO_FIXED_ADDR         (0x00u)     /* R/W fixed address */
#define SDC_SDIO_INCREMENT_ADDR     (0x01u)     /* R/W increment address */

/* ---- IO register write mode ---- */
#define SDC_SDIO_SIMPLE_WRITE       (0x0000u)   /* Just Write */
#define SDC_SDIO_READ_AFTER_WRITE   (0x0001u)   /* Read after Write */
#define SDC_SDIO_SIMPLE_READ        (0x0000u)   /* Just Read */

/* ---- Mask CCCR regiter big ---- */
#define SDC_SDIO_MASK_CD_DIS_BUS_WIDTH   (0x83u)     /* Mask CD Disable bit and bus width bit */

typedef enum e_enum_sdc_sd_trans
{
    SDC_SD_SET_TRANS_STOP,
    SDC_SD_SET_TRANS_START
} enum_sdc_sd_trans_t;

typedef enum e_enum_sdc_sd_cmd
{
    SDC_SD_SET_STOP,
    SDC_SD_SET_BUFFER
} enum_sdc_sd_cmd_t;

/* ---- Error code ---- */
typedef enum e_sdc_sd_status
{
    SDC_SD_SUCCESS_LOCKED_CARD  =   1,    /* OK but card is locked status. */
    SDC_SD_SUCCESS              =   0,    /* OK */
    SDC_SD_ERR                  =  -1,    /* General error */
    SDC_SD_ERR_WP               =  -2,    /* Write protect error */
    SDC_SD_ERR_RO               =  -3,    /* Read only error */
    SDC_SD_ERR_RES_TOE          =  -4,    /* Response time out error */
    SDC_SD_ERR_CARD_TOE         =  -5,    /* Card time out error */
    SDC_SD_ERR_END_BIT          =  -6,    /* End bit error */
    SDC_SD_ERR_CRC              =  -7,    /* CRC error */
    SDC_SD_ERR_CARD_RES         =  -8,    /* Card response error */
    SDC_SD_ERR_HOST_TOE         =  -9,    /* Host time out error */
    SDC_SD_ERR_CARD_ERASE       = -10,    /* Card erase error */
    SDC_SD_ERR_CARD_LOCK        = -11,    /* Card lock error */
    SDC_SD_ERR_CARD_UNLOCK      = -12,    /* Card unlock error */
    SDC_SD_ERR_CARD_CRC         = -13,    /* Card CRC error */
    SDC_SD_ERR_CARD_ECC         = -14,    /* Card internal ECC error */
    SDC_SD_ERR_CARD_CC          = -15,    /* Card internal error */
    SDC_SD_ERR_CARD_ERROR       = -16,    /* Unknown card error */
    SDC_SD_ERR_CARD_TYPE        = -17,    /* Non supported card type */
    SDC_SD_ERR_NO_CARD          = -18,    /* No card */
    SDC_SD_ERR_ILL_READ         = -19,    /* Illegal buffer read */
    SDC_SD_ERR_ILL_WRITE        = -20,    /* Illegal buffer write */
    SDC_SD_ERR_AKE_SEQ          = -21,    /* Sequence of authentication process */
    SDC_SD_ERR_OVERWRITE        = -22,    /* CID/CSD overwrite error */
    SDC_SD_ERR_CPU_IF           = -30,    /* Target MCU interface function error */
    SDC_SD_ERR_STOP             = -31,    /* User stop */
    SDC_SD_ERR_CSD_VER          = -50,    /* CSD register version error */
    SDC_SD_ERR_SCR_VER          = -51,    /* SCR register version error */
    SDC_SD_ERR_FILE_FORMAT      = -52,    /* CSD register file format error  */
    SDC_SD_ERR_NOTSUP_CMD       = -53,    /* Not supported command */
    SDC_SD_ERR_ILL_FUNC         = -60,    /* Invalid function request error */
    SDC_SD_ERR_IO_VERIFY        = -61,    /* Direct write verify error */
    SDC_SD_ERR_IO_CAPAB         = -62,    /* IO capability error */
    SDC_SD_ERR_IFCOND_VER       = -70,    /* Interface condition version error */
    SDC_SD_ERR_IFCOND_VOLT      = -71,    /* Interface condition voltage error */
    SDC_SD_ERR_IFCOND_ECHO      = -72,    /* Interface condition echo back pattern error */
    SDC_SD_ERR_OUT_OF_RANGE     = -80,    /* Argument was out of range */
    SDC_SD_ERR_ADDRESS_ERROR    = -81,    /* Misaligned address */
    SDC_SD_ERR_BLOCK_LEN_ERROR  = -82,    /* Transferred block length is not allowed. */
    SDC_SD_ERR_ILLEGAL_COMMAND  = -83,    /* Command not legal */
    SDC_SD_ERR_RESERVED_ERROR18 = -84,    /* Reserved bit 18 Error */
    SDC_SD_ERR_RESERVED_ERROR17 = -85,    /* Reserved bit 17 Error */
    SDC_SD_ERR_CMD_ERROR        = -86,    /* SDHI_SDSTS2 bit 0 CMD error */
    SDC_SD_ERR_CBSY_ERROR       = -87,    /* SDHI_SDSTS2 bit 14 CMD Type Reg Busy error */
    SDC_SD_ERR_NO_RESP_ERROR    = -88,    /* SDHI_SDSTS1 bit 0 No Response error */
    SDC_SD_ERR_ADDRESS_BOUNDARY = -89,    /* Not specified buffer address in 4-byte unit */
    SDC_SD_ERR_UNSUPPORTED_TYPE = -97,    /* Unsupported type */
    SDC_SD_ERR_API_LOCK         = -98,    /* Lock the driver API */
    SDC_SD_ERR_INTERNAL         = -99     /* Driver software internal error */
} sdc_sd_status_t;

typedef struct
{
    uint32_t    cmd;
    uint32_t    mode;
    uint8_t     *p_buff;
    uint32_t    size;
}sdc_sd_cmd_t;

typedef struct
{
    uint32_t    mode;
    uint32_t    voltage;
}sdc_sd_cfg_t;

typedef struct
{
    uint8_t     *p_buff;
    uint32_t    lbn;
    int32_t     cnt;
    uint32_t    mode;
    uint32_t    write_mode;
}sdc_sd_access_t;

typedef struct
{
    uint32_t card_sector_size;  /* Sector size (user area) */
    uint32_t prot_sector_size;  /* Sector size (protect area) */
    uint8_t  write_protect;     /* Write protect:           OFF : 0x00  */
                                /*                       H/W WP : 0x01  */
                                /*       CSD  TMP_WRITE_PROTECT : 0x02  */
                                /*       CSD PERM_WRITE_PROTECT : 0x04  */
                                /*       SD ROM                 : 0x10  */
    uint8_t  media_type;        /* Card media type                      */
    uint8_t  csd_structure;     /* CSD structure (Standard capacity:0 High capacity:1) */
    uint8_t  speed_mode;        /* Card speed mode: current speed  :bit0      Default:0 / High-speed:1 */
                                /* bit:             supported speed:bit4      Default:0 / High-speed:1 */
    uint8_t  io_speed_mode;     /* IO speed mode:   current speed  :bit[0:1]  Default:0 / High-speed:1 / Low-speed:2 */
                                /* bit:             supported speed:bit[4:5]  Default:0 / High-speed:1 / Low-speed:2 */
    uint8_t  rsv[3];
}sdc_sd_card_status_t;

typedef struct
{
    uint32_t    sdio_ocr[1];    /* SDIO OCR value */
    uint32_t    ocr[1];         /* OCR value */
    uint32_t    cid[4];         /* CID value */
    uint32_t    csd[4];         /* CSD value */
    uint32_t    dsr[1];         /* DSR value */
    uint32_t    rca[2];         /* RCA value */
    uint32_t    scr[2];         /* SCR value */
    uint32_t    sdstatus[4];    /* SD STATUS value */
    uint32_t    switch_func_status[5];  /* SWITCH FUNCTION STATUS DATA */
}sdc_sd_card_reg_t;

typedef struct
{
    uint8_t     *p_buff;
    uint32_t    func;
    uint32_t    adr;
    uint32_t    raw_flag;
    uint32_t    rw_flag;
} sdc_sdio_daccess_t;

typedef struct
{
    uint8_t     *p_buff;
    uint32_t    func;
    uint32_t    adr;
    int32_t     cnt;
    uint32_t    op_code;
    uint8_t     trans_mode;
    uint8_t     rsv[3];
} sdc_sdio_access_t;

typedef struct
{
    uint32_t    func;
    int32_t     cnt;
    uint32_t    *p_comm_cis_ptr;
    uint8_t     *p_cis_buff;
} sdc_sdio_cis_t;



/**********************************************************************************************************************
Exported global functions (to be accessed by other files)
**********************************************************************************************************************/
sdc_sd_status_t R_SDC_SD_Open(uint32_t card_no, uint32_t channel, void * p_sdc_sd_workarea);
sdc_sd_status_t R_SDC_SD_Close(uint32_t card_no);
sdc_sd_status_t R_SDC_SD_GetCardDetection(uint32_t card_no);
sdc_sd_status_t R_SDC_SD_Initialize(uint32_t card_no, sdc_sd_cfg_t * p_sdc_sd_config, uint32_t init_type);
sdc_sd_status_t R_SDC_SD_End(uint32_t card_no, uint32_t end_type);
sdc_sd_status_t R_SDC_SD_Control(uint32_t card_no, sdc_sd_cmd_t * p_sdc_sd_cmd);
sdc_sd_status_t R_SDC_SD_GetModeStatus(uint32_t card_no, uint8_t * p_mode);
sdc_sd_status_t R_SDC_SD_GetCardStatus(uint32_t card_no, sdc_sd_card_status_t * p_sdc_sd_card_status);
sdc_sd_status_t R_SDC_SD_GetCardInfo(uint32_t card_no, sdc_sd_card_reg_t * p_sdc_sd_card_reg);
sdc_sd_status_t R_SDC_SD_CdInt(uint32_t card_no, int32_t enable, sdc_sd_status_t (* callback)(int32_t));
sdc_sd_status_t R_SDC_SD_IntCallback(uint32_t card_no, sdc_sd_status_t (* callback)(int32_t));
sdc_sd_status_t R_SDC_SD_GetErrCode(uint32_t card_no);
void            R_SDC_SD_1msInterval(void);
sdc_sd_status_t R_SDC_SD_SetLogHdlAddress(uint32_t user_long_que);
uint32_t        R_SDC_SD_Log(uint32_t flg, uint32_t fid, uint32_t line);
sdc_sd_status_t R_SDC_SD_GetBuffRegAddress(uint32_t card_no, uint32_t * p_reg_buff);
uint32_t        R_SDC_SD_GetVersion(void);
sdc_sd_status_t R_SDC_SD_SetDmacDtcTransFlg(uint32_t card_no, uint32_t flg);

